Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/edc/PIC32MZ2064DAK176.PIC
      <edc:SFRDef edc:_addr="0x1F860240" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnn-------nnnn-" edc:cname="ODCC" edc:desc="" edc:grp="PORTC" edc:impl="0xfffff01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-------0000-" edc:name="ODCC" edc:nzwidth="0x20" edc:por="----------------0000-------0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCC1" edc:desc="" edc:mask="0x1" edc:name="ODCC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC2" edc:desc="" edc:mask="0x1" edc:name="ODCC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC3" edc:desc="" edc:mask="0x1" edc:name="ODCC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC4" edc:desc="" edc:mask="0x1" edc:name="ODCC4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCC12" edc:desc="" edc:mask="0x1" edc:name="ODCC12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC13" edc:desc="" edc:mask="0x1" edc:name="ODCC13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC14" edc:desc="" edc:mask="0x1" edc:name="ODCC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC15" edc:desc="" edc:mask="0x1" edc:name="ODCC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860250" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnn-------nnnn-" edc:cname="CNPUC" edc:desc="" edc:grp="PORTC" edc:impl="0xfffff01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-------0000-" edc:name="CNPUC" edc:nzwidth="0x20" edc:por="----------------0000-------0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUC1" edc:desc="" edc:mask="0x1" edc:name="CNPUC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC2" edc:desc="" edc:mask="0x1" edc:name="CNPUC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC3" edc:desc="" edc:mask="0x1" edc:name="CNPUC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC4" edc:desc="" edc:mask="0x1" edc:name="CNPUC4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUC12" edc:desc="" edc:mask="0x1" edc:name="CNPUC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC13" edc:desc="" edc:mask="0x1" edc:name="CNPUC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC14" edc:desc="" edc:mask="0x1" edc:name="CNPUC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC15" edc:desc="" edc:mask="0x1" edc:name="CNPUC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860260" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnn-------nnnn-" edc:cname="CNPDC" edc:desc="" edc:grp="PORTC" edc:impl="0xfffff01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-------0000-" edc:name="CNPDC" edc:nzwidth="0x20" edc:por="----------------0000-------0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDC1" edc:desc="" edc:mask="0x1" edc:name="CNPDC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC2" edc:desc="" edc:mask="0x1" edc:name="CNPDC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC3" edc:desc="" edc:mask="0x1" edc:name="CNPDC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC4" edc:desc="" edc:mask="0x1" edc:name="CNPDC4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDC12" edc:desc="" edc:mask="0x1" edc:name="CNPDC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC13" edc:desc="" edc:mask="0x1" edc:name="CNPDC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC14" edc:desc="" edc:mask="0x1" edc:name="CNPDC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC15" edc:desc="" edc:mask="0x1" edc:name="CNPDC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
